# Приветственное сообщение
HELLO = "Приветствую! Это бот Символики и бла, бла, бла..."

# Сообщение о создании заказа
CREATE_ORDER = "Создаём заказ?"

# Кнопка создания заказа
CREATE_ORDER_BUTTON = "Создать заказ"

# Первый этап (выбор категории товара)
FIRST_STEP = "Выберите категорию товара"

# Категории товаров
K1 = "Полиграфия"

K2 = "Широкоформат"

K3 = "Шелкография, ДТФ"

K4 = "Сувениры"

K5 = "Флаги, сублимация"

K6 = "Конструкции, монтажи"

K7 = "Закупка"

K8 = "Расчёт"

# Второй этап (выбор подкатегории товара)
SECOND_STEP = "Выберите подкатегорию"

# Подкатегории

# Подкатегории к "Полиграфия"
K1P1 = "Цифровая печать"
K1P1_DETAILS = "Вот заранее заготовленный текст, где я хочу уточнить у тебя пару моментов:\n1.\n2.\n3."

K1P2 = "Офсет"
K1P2_DETAILS = ""

# Подкатегории к "Широкоформат"
K2P1 = "Баннеры"
K2P1_DETAILS = ""

K2P2 = "Наклейки"
K2P2_DETAILS = ""

K2P3 = "Таблички"
K2P3_DETAILS = ""

K2P4 = "Стенды"
K2P4_DETAILS = ""

# Подкатегории к "Шелкография, ДТФ"
K3P1 = "Шелкография"
K3P1_DETAILS = ""

K3P2 = "ДТФ"
K3P2_DETAILS = ""

K3P3 = "Термотрансфер"
K3P3_DETAILS = ""

# Подкатегории к "Сувениры"
K4P1 = "Уф-печать"
K4P1_DETAILS = ""

K4P2 = "Гравировка"
K4P2_DETAILS = ""

K4P3 = "Тиснение"
K4P3_DETAILS = ""

K4P4 = "Сублимация"
K4P4_DETAILS = ""

# Подкатегории к "Флаги, сублимация"
K5P1 = "Флаги"
K5P1_DETAILS = ""

K5P2 = "Пошив текстиля"
K5P2_DETAILS = ""

# Подкатегории к "Конструкции, монтажи"
K6P1 = "Джокер"
K6P1_DETAILS = ""

K6P2 = "Брус"
K6P2_DETAILS = ""

K6P3 = "Монтажи"
K6P3_DETAILS = ""

K6P4 = "Виндеры"
K6P4_DETAILS = ""

# Подкатегории к "Закупка"
K7P1 = "Текстиль"
K7P1_DETAILS = ""

K7P2 = "Проект"
K7P2_DETAILS = ""

K7P3 = "Оазис"
K7P3_DETAILS = ""

K7P4 = "Прочее"
K7P4_DETAILS = ""

# Подкатегории к "Расчёт"
K8P1 = "Полиграфия"
K8P1_DETAILS = ""

K8P2 = "Широкоформат"
K8P2_DETAILS = ""

K8P3 = "Текстиль"
K8P3_DETAILS = ""

K8P4 = "Сувениры"
K8P4_DETAILS = ""

K8P5 = "Конструкции, монтажи"
K8P5_DETAILS = ""

# Отчёт бота
SEND = "Отлично! Сейчас наши менеджеры всё обдумают и ответят тебе. Можешь пока заварить чай или кофе)"
