# Приветственное сообщение
HELLO = "Приветствую! Это бот Символики и бла, бла, бла..."

# Сообщение о создании заказа
CREATE_ORDER = "Создаём заказ?"

# Кнопка создания заказа
CREATE_ORDER_BUTTON = "Создать заказ"

# Первый этап (выбор категории товара)
FIRST_STEP = "Выберите категорию товара"

# Текст на фоне поля ввода на первом этапе
STAGE_ONE_BACKTEXT = "Категория"

# Категории товаров
K1 = "Полиграфия"

K2 = "Широкоформат"

K3 = "Шелкография, ДТФ"

K4 = "Сувениры"

K5 = "Флаги, сублимация"

K6 = "Конструкции, монтажи"

K7 = "Закупка"

K8 = "Расчёт"

# Второй этап (выбор подкатегории товара)
SECOND_STEP = "Выберите подкатегорию"

# Текст на фоне поля ввода на втором этапе
STAGE_TWO_BACKTEXT = "Подкатегория"

##### Подкатегории

### Подкатегории к "Полиграфия"
K1P1 = "Цифровая печать"
K1P1_DETAILS = "Вот заранее заготовленный текст, где я хочу уточнить у тебя пару моментов:\n1.\n2.\n3."

K1P2 = "Офсет"
K1P2_DETAILS = "12"

### Подкатегории к "Широкоформат"
K2P1 = "Баннеры"
K2P1_DETAILS = "21"

K2P2 = "Наклейки"
K2P2_DETAILS = "22"

K2P3 = "Таблички"
K2P3_DETAILS = "23"

K2P4 = "Стенды"
K2P4_DETAILS = "24"

### Подкатегории к "Шелкография, ДТФ"
K3P1 = "Шелкография"
K3P1_DETAILS = "31"

K3P2 = "ДТФ"
K3P2_DETAILS = "32"

K3P3 = "Термотрансфер"
K3P3_DETAILS = "33"

### Подкатегории к "Сувениры"
K4P1 = "Уф-печать"
K4P1_DETAILS = "41"

K4P2 = "Гравировка"
K4P2_DETAILS = "42"

K4P3 = "Тиснение"
K4P3_DETAILS = "43"

K4P4 = "Сублимация"
K4P4_DETAILS = "44"

### Подкатегории к "Флаги, сублимация"
K5P1 = "Флаги"
K5P1_DETAILS = "51"

K5P2 = "Пошив текстиля"
K5P2_DETAILS = "52"

### Подкатегории к "Конструкции, монтажи"
K6P1 = "Джокер"
K6P1_DETAILS = "61"

K6P2 = "Брус"
K6P2_DETAILS = "62"

K6P3 = "Монтажи"
K6P3_DETAILS = "63"

K6P4 = "Виндеры"
K6P4_DETAILS = "64"

### Подкатегории к "Закупка"
K7P1 = "Текстиль"
K7P1_DETAILS = "71"

K7P2 = "Проект"
K7P2_DETAILS = "72"

K7P3 = "Оазис"
K7P3_DETAILS = "73"

K7P4 = "Прочее"
K7P4_DETAILS = "74"

### Подкатегории к "Расчёт"
K8P1 = "Полиграфия"
K8P1_DETAILS = "81"

K8P2 = "Широкоформат"
K8P2_DETAILS = "82"

K8P3 = "Текстиль"
K8P3_DETAILS = "83"

K8P4 = "Сувениры"
K8P4_DETAILS = "84"

K8P5 = "Конструкции, монтажи"
K8P5_DETAILS = "85"

# Отчёт бота пользователю, когда бот отправляет сообщение в беседу менеджеров
SEND = "Отлично! Сейчас наши менеджеры всё обдумают и ответят тебе. Можешь пока заварить чай или кофе)"

# Если менеджер попытался ответить на сообщение бота,
# а он уже получил ответ
ALREADY = "Пользователь уже получил ответ"
