# Приветственное сообщение
HELLO = "Привет! Это внутренний бот Символики, через который ты можешь запустить заказ в производство"

# Сообщение о создании заказа
CREATE_ORDER = "Создаём заказ?"

# Кнопка создания заказа
CREATE_ORDER_BUTTON = "Создать заказ"

# Первый этап (выбор категории товара)
FIRST_STEP = "Выберите категорию товара"

# Текст на фоне поля ввода на первом этапе
STAGE_ONE_BACKTEXT = "Категория"

# Категории товаров
K1 = "Полиграфия"

K2 = "Широкоформат"

K3 = "Шелкография, ДТФ"

K4 = "Сувениры"

K5 = "Флаги, сублимация"

K6 = "Конструкции, монтажи"

K7 = "Закупка"

K8 = "Расчёт"

# Второй этап (выбор подкатегории товара)
SECOND_STEP = "Выберите подкатегорию"

# Текст на фоне поля ввода на втором этапе
STAGE_TWO_BACKTEXT = "Подкатегория"

##### Подкатегории
ABOUT_FINISH = "\n\nТекст в сообщении с картинками я читать не умею!\nКогда отправишь всё необходимое, выполни команду /finish"
### Подкатегории к "Полиграфия"
K1P1 = "Цифровая печать"
K1P1_DETAILS = "Не забудь указать формат, цветность, плотность бумаги и тираж. Макет прикрепляй в отдельном сообщении" + ABOUT_FINISH

K1P2 = "Офсет"
K1P2_DETAILS = "Не забудь указать формат, цветность, плотность бумаги и тираж. Макет прикрепляй в отдельном сообщении" + ABOUT_FINISH

### Подкатегории к "Широкоформат"
K2P1 = "Баннеры"
K2P1_DETAILS = "Не забудь указать размер, нужна ли проклейка и люверсы. Если люверсы нужно установить нестандартно, не забудь это" + ABOUT_FINISH

K2P2 = "Наклейки"
K2P2_DETAILS = "Не забудь указать размер, тип (наклейки, стикерпаки, наклейки со смолой)" + ABOUT_FINISH

K2P3 = "Таблички"
K2P3_DETAILS = "Не забудь указать размер, нужна ли ламинация и какая (матовая или глянцевая)" + ABOUT_FINISH

K2P4 = "Стенды"
K2P4_DETAILS = "Не забудь указать размер стенда, нужны ли карманы и их размер, нужна ли ламинация и какая (матовая или глянцевая)" + ABOUT_FINISH

### Подкатегории к "Шелкография, ДТФ"
K3P1 = "Шелкография"
K3P1_DETAILS = "Не забудь указать размеры принта, расположение, прикрепить макет с расположением (в отдельном сообщении)" + ABOUT_FINISH

K3P2 = "ДТФ"
K3P2_DETAILS = "Не забудь указать размеры принта, расположение, прикрепить макет с расположением (в отдельном сообщении)" + ABOUT_FINISH

K3P3 = "Термотрансфер"
K3P3_DETAILS = "Не забудь указать размеры принта, расположение, прикрепить макет с расположением (в отдельном сообщении)" + ABOUT_FINISH

### Подкатегории к "Сувениры"
K4P1 = "Уф-печать"
K4P1_DETAILS = "Не забудь указать размеры принта, расположение, прикрепить макет с расположением (в отдельном сообщении)" + ABOUT_FINISH

K4P2 = "Гравировка"
K4P2_DETAILS = "Не забудь указать размеры принта, расположение, прикрепить макет с расположением (в отдельном сообщении)" + ABOUT_FINISH

K4P3 = "Тиснение"
K4P3_DETAILS = "Не забудь указать размеры принта, расположение, прикрепить макет с расположением (в отдельном сообщении)" + ABOUT_FINISH

K4P4 = "Сублимация"
K4P4_DETAILS = "Не забудь указать размеры принта, расположение, прикрепить макет с расположением (в отдельном сообщении)" + ABOUT_FINISH

### Подкатегории к "Флаги, сублимация"
K5P1 = "Флаги"
K5P1_DETAILS = "Не забудь указать размеры принта, расположение, прикрепить макет с расположением (в отдельном сообщении)" + ABOUT_FINISH

K5P2 = "Пошив текстиля"
K5P2_DETAILS = "Что шьем?" + ABOUT_FINISH

### Подкатегории к "Конструкции, монтажи"
K6P1 = "Джокер"
K6P1_DETAILS = "Размеры конструкции" + ABOUT_FINISH

K6P2 = "Брус"
K6P2_DETAILS = "Размеры конструкции" + ABOUT_FINISH

K6P3 = "Монтажи"
K6P3_DETAILS = "Дата, вид конструкции, место установки" + ABOUT_FINISH

K6P4 = "Виндеры"
K6P4_DETAILS = "Размеры конструкции" + ABOUT_FINISH

### Подкатегории к "Закупка"
K7P1 = "Текстиль"
K7P1_DETAILS = "Что закупаем и где?" + ABOUT_FINISH

K7P2 = "Проект"
K7P2_DETAILS = "Готова ли корзина к заказу?" + ABOUT_FINISH

K7P3 = "Оазис"
K7P3_DETAILS = "Готова ли корзина к заказу?" + ABOUT_FINISH

K7P4 = "Прочее"
K7P4_DETAILS = "Что закупаем и где?" + ABOUT_FINISH

### Подкатегории к "Расчёт"
K8P1 = "Полиграфия"
K8P1_DETAILS = "Что нужно посчитать?" + ABOUT_FINISH

K8P2 = "Широкоформат"
K8P2_DETAILS = "Что нужно посчитать?" + ABOUT_FINISH

K8P3 = "Текстиль"
K8P3_DETAILS = "Что нужно посчитать?" + ABOUT_FINISH

K8P4 = "Сувениры"
K8P4_DETAILS = "Что нужно посчитать?" + ABOUT_FINISH

K8P5 = "Конструкции, монтажи"
K8P5_DETAILS = "Что нужно посчитать?" + ABOUT_FINISH

# Отчёт бота пользователю, когда бот отправляет сообщение в беседу менеджеров
SEND = "Заявка передана в обработку"

# Заголовок для ответа
# Когда пользователю приходит ответ, ему указывается на какое сообщение этот ответ,
# и над этим сообщением есть заголовок
ANSWER_HEAD = "Ответ"

# Не получилось отправить ответ
FAIL = "Я могу переслать ответ, только если ты ответишь на текстовое сообщение"
